"""
1.	Написать программу поиска самого длинного слова в строке, разделенной пробелами.
Ales Blitz Burger Community Cut out Decadent Generosity Sapsan Semi-dark Tamer
"""
#print(max([len(i) for i in input("Строка: ").split()]))